app/controllers/sessions_controller.rb

  def create
    users = Users.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "thiago@guimaraes.com"], ["LIMIT", 1]]