app/controllers/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "ricard@gay.com"], ["crypted_password", "123123"], ["created_at", "2017-06-12 19:36:56.719033"], ["updated_at", "2017-06-12 19:36:56.719033"]]
---
  def create
    email = params['session']['email']
    password = params['session']['password']

    user = User.new
    user.email = email
    user.crypted_password = password

    if user.save